---
kind: property
id: P:Autodesk.Revit.DB.NavisworksExportOptions.ExportParts
source: html/9873bff8-39a6-a972-5a28-b955f8eae46d.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions.ExportParts Property

True to export Revit part elements, false to export the original parent elements.
 Default value is false.

## Syntax (C#)
```csharp
public bool ExportParts { get; set; }
```